formal/mutants/m4-lp-two-byte-length.patch
Mutant: LP writes a 2-byte length prefix instead of uint32_be.

--- a/core/src/hashx.rs
+++ b/core/src/hashx.rs
@@ -11,7 +11,7 @@
     if b.len() > MAX_LP_LEN {
         return false;
     }
-    out.extend_from_slice(&(b.len() as u32).to_be_bytes());
+    out.extend_from_slice(&(b.len() as u16).to_be_bytes());
     out.extend_from_slice(b);
     true
 }
